OdRxAlternateLocalizedNameAttribute.createObject(System.UInt32,System.UInt32)
\details
Constructor. Creates an instance of the attribute to store a string
identifier.
\param id         [in]  Resource ID of the string.
\param sourceHint [in]  Resource ID hint.
\returns
Smart pointer to a constructed attribute object.